tutorials/casePCMFC/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.05 -0.025  -0.03)
    ( 0.05 -0.025  -0.03)
    ( 0.05  0.025  -0.03)
    (-0.05  0.025  -0.03)
    (-0.05 -0.025   0.03)
    ( 0.05 -0.025   0.03)
    ( 0.05  0.025   0.03)
    (-0.05  0.025   0.03)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 50 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)

        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    wall
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
